# DQLab - Data Engineer Challenge with SQL
![title](tables.png)

In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in b:\programdata\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: prettytable<1 in b:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in b:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.14.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in b:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.3.13)
Requirement already satisfied: ipython-genutils>=0.1.0 in b:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in b:\programdata\anaconda3\lib\site-packages (from ipython-sql) (7.12.0)
Requirement already satisfied: sqlparse in b:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: pickleshare in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: decorator in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.3)
Requirement already satisfied: pygments in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.5.2)
Requirement already satisfied: backcall in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: jedi>=0.10 in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.14.1)
Requirement already satisfied: colorama; sys_platform == "win32" in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: setuptools>=18.5 in b:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (45.2.0.post20200210)
Requirement already satisfied: wcwidth in b:\programdata\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.8)
Requirement already satisfied: parso>=0.5.0 in b:\programdata\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.2)

In [2]:
%load_ext sql

In [3]:
import sqlalchemy

In [4]:
%sql sqlite:///dqlab_product_mart.db

In [5]:
tables = sqlalchemy.create_engine('sqlite:///dqlab_product_mart.db').table_names()
print(tables)

['ms_pelanggan', 'ms_produk', 'tr_penjualan', 'tr_penjualan_detail']

---
## Produk DQLab Mart

Mengacu pada table ms_produk, tampilkan daftar produk yang memiliki harga antara 50.000 and 150.000.

##### - Nama kolom yang harus ditampilkan: no_urut, kode_produk, nama_produk, dan harga.

In [6]:
%sql SELECT no_urut, kode_produk, nama_produk, harga FROM ms_produk WHERE harga >= 50000 AND harga <= 150000;

 * sqlite:///dqlab_product_mart.db
Done.

[(1, 'prod-01', 'Kotak Pensil DQLab', 60500),
 (2, 'prod-02', 'Flashdisk DQLab 64 GB', 55000),
 (3, 'prod-03', 'Gift Voucher DQLab 100rb', 100000),
 (6, 'prod-06', 'Pulpen Multifunction + Laser DQLab', 92500),
 (9, 'prod-09', 'Buku Planner Agenda DQLab', 92000),
 (10, 'prod-10', 'Sticky Notes DQLab 500 sheets', 55000)]

---
## Thumb drive di DQLab Mart

Tampilkan semua produk yang mengandung kata Flashdisk.

##### - Nama kolom yang harus ditampilkan: no_urut, kode_produk, nama_produk, dan harga.

In [7]:
%sql SELECT no_urut, kode_produk, nama_produk, harga FROM ms_produk WHERE nama_produk LIKE '%Flashdisk%';

 * sqlite:///dqlab_product_mart.db
Done.

[(2, 'prod-02', 'Flashdisk DQLab 64 GB', 55000),
 (4, 'prod-04', 'Flashdisk DQLab 32 GB', 40000)]

---
## Pelanggan Bergelar

Tampilkan hanya nama-nama pelanggan yang hanya memiliki gelar-gelar berikut: S.H, Ir. dan Drs.

##### - Nama kolom yang harus ditampilkan: no_urut, kode_pelanggan, nama_pelanggan, dan alamat.

In [8]:
%sql SELECT no_urut, kode_pelanggan, nama_pelanggan, alamat FROM ms_pelanggan where nama_pelanggan LIKE '%S.H%' OR nama_pelanggan LIKE '%Ir.%' OR nama_pelanggan LIKE '%Drs.%';

 * sqlite:///dqlab_product_mart.db
Done.

[(1, 'cust0001', 'Eva Novianti, S.H.', 'Vila Sempilan, No. 67'),
 (9, 'cust0009', 'Ir. Ita Nugraha', 'Perumahan Sagitarius, Gang Kelapa No. 6'),
 (10, 'cust0010', 'Djoko Wardoyo, Drs.', 'Bukit Pintar Data, Blok A1 No. 1')]

---
## Mengurutkan Nama Pelanggan

Tampilkan nama-nama pelanggan dan urutkan hasilnya berdasarkan kolom nama_pelanggan dari yang terkecil ke yang terbesar (A ke Z).

##### - Nama kolom yang harus ditampilkan: nama_pelanggan.

In [9]:
%sql SELECT nama_pelanggan FROM ms_pelanggan ORDER BY nama_pelanggan ASC;

 * sqlite:///dqlab_product_mart.db
Done.

[('Agus Cahyono',),
 ('Djoko Wardoyo, Drs.',),
 ('Eva Novianti, S.H.',),
 ('Heidi Goh',),
 ('Ir. Ita Nugraha',),
 ('Irwan Setianto',),
 ('Jokolono Sukarman',),
 ('Maria Sirait',),
 ('Tommy Sinaga',),
 ('Unang Handoko',)]

---
## Mengurutkan Nama Pelanggan Tanpa Gelar

Tampilkan nama-nama pelanggan dan urutkan hasilnya berdasarkan kolom nama_pelanggan dari yang terkecil ke yang terbesar (A ke Z), namun gelar tidak boleh menjadi bagian dari urutan. Contoh: Ir. Agus Nugraha harus berada di atas Heidi Goh.

##### - Nama kolom yang harus ditampilkan: nama_pelanggan.

In [10]:
%sql SELECT nama_pelanggan FROM ms_pelanggan ORDER BY CASE WHEN SUBSTR(nama_pelanggan,1,4) = 'Ir. ' THEN REPLACE(nama_pelanggan,'Ir. ', '') ELSE nama_pelanggan END;

 * sqlite:///dqlab_product_mart.db
Done.

[('Agus Cahyono',),
 ('Djoko Wardoyo, Drs.',),
 ('Eva Novianti, S.H.',),
 ('Heidi Goh',),
 ('Irwan Setianto',),
 ('Ir. Ita Nugraha',),
 ('Jokolono Sukarman',),
 ('Maria Sirait',),
 ('Tommy Sinaga',),
 ('Unang Handoko',)]

---
## Nama Pelanggan yang Paling Panjang

Tampilkan nama pelanggan yang memiliki nama paling panjang. Jika ada lebih dari 1 orang yang memiliki panjang nama yang sama, tampilkan semuanya.

##### - Nama kolom yang harus ditampilkan: nama_pelanggan.

In [11]:
%sql SELECT nama_pelanggan FROM ms_pelanggan WHERE LENGTH(nama_pelanggan) = (SELECT MAX(hasil) FROM (SELECT LENGTH(nama_pelanggan) AS hasil FROM ms_pelanggan) ms_pelanggan);

 * sqlite:///dqlab_product_mart.db
Done.

[('Djoko Wardoyo, Drs.',)]

---
## Nama Pelanggan yang Paling Panjang dengan Gelar

Tampilkan nama orang yang memiliki nama paling panjang (pada row atas), dan nama orang paling pendek (pada row setelahnya). Gelar menjadi bagian dari nama. Jika ada lebih dari satu nama yang paling panjang atau paling pendek, harus ditampilkan semuanya.

##### - Nama kolom yang harus ditampilkan: nama_pelanggan.

In [12]:
%sql SELECT nama_pelanggan FROM ms_pelanggan WHERE LENGTH(nama_pelanggan) = (SELECT MAX(hasil) FROM (SELECT LENGTH(nama_pelanggan) hasil FROM ms_pelanggan) ms_pelanggan) UNION SELECT nama_pelanggan FROM ms_pelanggan WHERE LENGTH(nama_pelanggan) = (SELECT MIN(hasil) FROM (SELECT LENGTH(nama_pelanggan) hasil FROM ms_pelanggan) ms_pelanggan);

 * sqlite:///dqlab_product_mart.db
Done.

[('Djoko Wardoyo, Drs.',), ('Heidi Goh',)]

---
## Kuantitas Produk yang Banyak Terjual

Tampilkan produk yang paling banyak terjual dari segi kuantitas. Jika ada lebih dari 1 produk dengan nilai yang sama, tampilkan semua produk tersebut.

##### - Nama kolom yang harus ditampilkan: kode_produk, nama_produk,total_qty.

In [13]:
%sql SELECT msp.kode_produk, nama_produk, total_qty FROM ms_produk msp INNER JOIN (SELECT kode_produk, SUM(qty) AS total_qty FROM tr_penjualan_detail GROUP BY kode_produk ORDER BY total_qty DESC LIMIT 2) AS a ON a.kode_produk = msp.kode_produk;

 * sqlite:///dqlab_product_mart.db
Done.

[('prod-08', 'Gantungan Kunci DQLab', 7),
 ('prod-04', 'Flashdisk DQLab 32 GB', 7)]

---
## Pelanggan Paling Tinggi Nilai Belanjanya

Siapa saja pelanggan yang paling banyak menghabiskan uangnya untuk belanja? Jika ada lebih dari 1 pelanggan dengan nilai yang sama, tampilkan semua pelanggan tersebut.

##### - Nama kolom yang harus ditampilkan: kode_pelanggan, nama_pelanggan, total_harga.

In [14]:
%sql SELECT trp.kode_pelanggan, nama_pelanggan, total_harga FROM ms_pelanggan msp INNER JOIN (SELECT kode_pelanggan, SUM(total_harga) AS total_harga FROM (SELECT DISTINCT trp.kode_transaksi, trp.kode_pelanggan, a.total_harga AS total_harga FROM tr_penjualan trp INNER JOIN (SELECT kode_transaksi, SUM(total) AS total_harga FROM (SELECT kode_transaksi, qty, harga_satuan, qty*harga_satuan AS total FROM tr_penjualan_detail) tr_penjualan_detail GROUP BY kode_transaksi) a ON trp.kode_transaksi = a.kode_transaksi) tr_penjualan GROUP BY kode_pelanggan ORDER BY total_harga DESC LIMIT 1) trp ON msp.kode_pelanggan = trp.kode_pelanggan;

 * sqlite:///dqlab_product_mart.db
Done.

[('cust0007', 'Agus Cahyono', 175000)]

---
## Pelanggan yang Belum Pernah Berbelanja

Tampilkan daftar pelanggan yang belum pernah melakukan transaksi.

##### - Nama kolom yang harus ditampilkan: kode_pelanggan, nama_pelanggan, alamat.

In [15]:
%sql SELECT msp.kode_pelanggan, nama_pelanggan, alamat FROM ms_pelanggan msp WHERE NOT EXISTS(SELECT trp.kode_pelanggan FROM tr_penjualan trp WHERE msp.kode_pelanggan = trp.kode_pelanggan);

 * sqlite:///dqlab_product_mart.db
Done.

[('cust0002', 'Heidi Goh', 'Ruko Sawit Permai 72 No. 1'),
 ('cust0005', 'Tommy Sinaga', 'Avatar Village, Blok C8 No. 888'),
 ('cust0006', 'Irwan Setianto', 'Rukan Gunung Seribu, Blok O1 - No. 1'),
 ('cust0009', 'Ir. Ita Nugraha', 'Perumahan Sagitarius, Gang Kelapa No. 6'),
 ('cust0010', 'Djoko Wardoyo, Drs.', 'Bukit Pintar Data, Blok A1 No. 1')]

---
## Transaksi Belanja dengan Daftar Belanja lebih dari 1

Tampilkan transaksi-transaksi yang memiliki jumlah item produk lebih dari 1 jenis produk. Dengan lain kalimat, tampilkan transaksi-transaksi yang memiliki jumlah baris data pada table tr_penjualan_detail lebih dari satu.

##### - Nama kolom yang harus ditampilkan:  kode_transaksi, kode_pelanggan, nama_pelanggan, tanggal_transaksi, jumlah_detail

In [16]:
%sql SELECT c.kode_transaksi, c.kode_pelanggan, nama_pelanggan, c.tanggal_transaksi, c.jumlah_detail FROM ms_pelanggan msp INNER JOIN (SELECT DISTINCT trp.kode_transaksi, kode_pelanggan, tanggal_transaksi, a.jumlah AS jumlah_detail FROM tr_penjualan trp INNER JOIN (SELECT kode_transaksi, COUNT(1) jumlah FROM tr_penjualan_detail GROUP BY kode_transaksi HAVING COUNT(*) > 1) a ON trp.kode_transaksi = a.kode_transaksi) c ON msp.kode_pelanggan = c.kode_pelanggan;

 * sqlite:///dqlab_product_mart.db
Done.

[('tr-0001', 'cust0007', 'Agus Cahyono', '2019-06-07 10:09:46', 2)]